src/DataProcessors/ПереносМТКИзБазы1С7/ПереносМТКИзБазы1С7.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПереносМТКИзБазы1С7</name>
  <attributes>
    <name>ИмяПользователя</name>
    <comment>Имя пользователя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <comment>Пароль</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменДанными</name>
    <type>
      <types>CatalogRef.ОбменДанными</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/Documents/МаршрутнаяКарта/МаршрутнаяКарта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаршрутнаяКарта</name>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <basedOn>Document.РемонтнаяКарта</basedOn>
  <basedOn>Document.СписаниеМПЗПрочее</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.ПланыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РемонтнаяКарта</types>
      <types>DocumentRef.СписаниеМПЗПрочее</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОчереди</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейкаИнициатор</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияПотребитель</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Счёт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ремонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПредполагаемогоОкончанияОстановки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторОстановки</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>МПЗОстановки</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОстановки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтандартныйКомментарий</name>
    <type>
      <types>CatalogRef.СтандартныеКомментарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаРасходов</name>
      <type>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналогНормыРасходов</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехОперации</name>
    <attributes>
      <name>ТехОперация</name>
      <type>
        <types>CatalogRef.ТехОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Остановки</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияПредполагаемая</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.ПричиныОстановок</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Инициатор</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаЛинеек</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Виртуальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНахожденияВБуфере</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПоМощности</name>
    <type>
      <types>CatalogRef.ГруппыПоМощности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияСпецификации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>Канбан</name>
    <type>
      <types>CatalogRef.ВидыКанбанов</types>
    </type>
  </attributes>
  <attributes>
    <name>КолВКанбане</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КолКанбан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолнНаименование</name>
    <comment>Полное наименование, краткие характеристики</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Промывка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделПоЕСКД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловныеПриборы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловныйКоэффициентПЭО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблоныТО</name>
    <type>
      <types>CatalogRef.ШаблоныТехОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПроизводства</name>
    <type>
      <types>CatalogRef.ЭтапыПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПиковыеПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрещеноКОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереходНаРедизайн</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПересмотра</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЛинииSMD</name>
    <attributes>
      <name>Линия</name>
      <type>
        <types>CatalogRef.ЛинииSMD</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛинейкиSMD</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Основная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/ПереносМТКИзБазы1С7/Forms/Форма/Module.bsl
&НаСервере
Функция ПолучитьСпецификацию(Наименование)
Возврат(Справочники.Номенклатура.НайтиПоНаименованию(Наименование,Истина));
КонецФункции

&НаКлиенте
Процедура Соединиться(Команда)
ТаблицаМТК.Очистить();
НастройкиОбменаДанными = ОбщийМодульСинхронизации.ПолучитьНастройкиОбменаДанными(Объект.ОбменДанными);
V7 = ОбщийМодульКлиент.ПодключитьсяК1С77(НастройкиОбменаДанными.ПутьКБазеДанных,Объект.ИмяПользователя,Объект.Пароль);
	Если V7 = Неопределено Тогда
	Возврат;	
	КонецЕсли;
Подразд = V7.CreateObject("Справочник.Подразделения");
Док = V7.CreateObject("Документ.Заказ");
Запрос = V7.CreateObject("Запрос");
	
ПериодЗапроса = "Период с '"+ Формат(Объект.Период.ДатаНачала,"ДФ=dd.MM.yy")+"' по '"+Формат(Объект.Период.ДатаОкончания,"ДФ=dd.MM.yy")+"';";
	Текст = "//{{ЗАПРОС(Заказ)
	|" + ПериодЗапроса + "
	|
	|ОбрабатыватьДокументы Непроведенные;
	|Обрабатывать НеПомеченныеНаУдаление;
	|	
	|Док 			= Документ.МаршрутнаяКарта.ТекущийДокумент;
	|
	|Группировка Док;                                                                     
	|";
Запрос.Выполнить(Текст);
		Пока Запрос.Группировка(1) = 1 Цикл
			Если Запрос.Док.ДокументОснование.Вид() <> "ПланВыпуска" Тогда
			Продолжить;
			КонецЕсли;
				Если Найти(Запрос.Док.ДокументОснование.Комментарий,"УД КАНБАН") > 0 Тогда
				Продолжить;
				КонецЕсли;
					Если СокрЛП(Запрос.Док.Спецификация.ЛинейкаПроизводства.НаименованиеНовое) <> СокрЛП(Линейка) Тогда
					Продолжить;
		            КонецЕсли;  
		Состояние("Обработка...",,"Поиск МТК "+Запрос.Док.НомерДок+"...");
		ТЧ = ТаблицаМТК.Добавить();
		ТЧ.НомерМТК = Запрос.Док.НомерДок;
		ТЧ.ДатаМТК = Запрос.Док.ДатаДок;
		ТЧ.Счёт = Запрос.Док.Счёт;
		ТЧ.ДатаОтгрузки = Запрос.Док.ДатаОтгрузки;
		ТЧ.Комментарий = Запрос.Док.Комментарий;
		ТЧ.Изделие = СокрЛП(Запрос.Док.Спецификация.Наименование);
		ТЧ.Спецификация = ПолучитьСпецификацию(ТЧ.Изделие);
		ТЧ.Пометка = ЗначениеЗаполнено(ТЧ.Спецификация); 
		ТЧ.Количество = Запрос.Док.Количество; 
	    КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СоздатьМТКНаСервере(Стр)
СтдКомм = Справочники.СтандартныеКомментарии.НайтиПоНаименованию("Заказанные датчики от клиентов",Истина);
ТЧ = ТаблицаМТК.НайтиПоИдентификатору(Стр);
МТК = ОбщийМодульСозданиеДокументов.СоздатьМТК(ТЧ.Спецификация.Линейка,ТЧ.Спецификация,ТЧ.Количество,СтдКомм,Справочники.Проекты.ПустаяСсылка(),Ложь,Истина,"",ТЧ.Счёт,ТЧ.ДатаОтгрузки);
ТЧ.Ссылка = МТК;	
КонецПроцедуры

&НаСервере
Функция ПолучитьНомерМТК(МТК)
Возврат("МТК изделия по 1С8: "+МТК.Номер + " от " + МТК.Дата);
КонецФункции

&НаСервере
Процедура СформироватьОтчет(СписокПодчиненных)
ТабДок.Очистить();
ОбъектЗн = РеквизитФормыВЗначение("Объект");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблСтрока = Макет.ПолучитьОбласть("Строка");
	Для каждого Стр Из СписокПодчиненных Цикл
	ОблСтрока.Параметры.МТКПодчиненная = Стр.Значение;
	ОблСтрока.Параметры.МТК = Стр.Представление;
	ТабДок.Вывести(ОблСтрока);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
НастройкиОбменаДанными = ОбщийМодульСинхронизации.ПолучитьНастройкиОбменаДанными(Объект.ОбменДанными);
V7 = ОбщийМодульКлиент.ПодключитьсяК1С77(НастройкиОбменаДанными.ПутьКБазеДанных,Объект.ИмяПользователя,Объект.Пароль);
	Если V7 = Неопределено Тогда
	Возврат;	
	КонецЕсли;
СписокПодчиненных = Новый СписокЗначений;

Док = V7.CreateObject("Документ.МаршрутнаяКарта");
ДокЗаказ = V7.CreateObject("Документ.План");
ДокПередача = V7.CreateObject("Документ.ТребованиеНакладная");
ДокВыпуск = V7.CreateObject("Документ.ВыпускПродукцииПоНормам");
ДокТехОперации = V7.CreateObject("Документ.ТехОперации");
ПодчДок = V7.CreateObject("Документ");
	Для каждого ТЧ Из ТаблицаМТК Цикл
		Если ТЧ.Пометка Тогда
		Состояние("Обработка...",,"Обработка МТК "+ТЧ.НомерМТК+"...");
		СоздатьМТКНаСервере(ТЧ.ПолучитьИдентификатор());
			Если ЗначениеЗаполнено(ТЧ.Ссылка) Тогда
				Если Док.НайтиПоНомеру(СокрЛП(ТЧ.НомерМТК),ТЧ.ДатаМТК) = 1 Тогда
				Док.Удалить(0);
				Док.ВыбратьСтроки();
					Пока Док.ПолучитьСтроку() = 1 Цикл
						Если V7.ПустоеЗначение(Док.ДокЗаказ) = 0 Тогда
						ДокЗаказ.НайтиДокумент(Док.ДокЗаказ);
						ДокЗаказ.Удалить(0);
						КонецЕсли; 
							Если V7.ПустоеЗначение(Док.ДокПередача) = 0 Тогда
							ДокПередача.НайтиДокумент(Док.ДокПередача);
							ДокПередача.Удалить(0);
							КонецЕсли; 
								Если V7.ПустоеЗначение(Док.ДокВыпуск) = 0 Тогда
								ДокВыпуск.НайтиДокумент(Док.ДокВыпуск);
								ДокВыпуск.Удалить(0);
								КонецЕсли;
					КонецЦикла;  
					Если ПодчДок.ВыбратьПодчиненныеДокументы(НачалоГода(ТекущаяДата()),ТекущаяДата(),Док.ТекущийДокумент()) = 1 Тогда
						Пока ПодчДок.ПолучитьДокумент() = 1 Цикл
							Если ПодчДок.ПометкаУдаления() = 1 Тогда
							Продолжить;	
							КонецЕсли;
								Если ПодчДок.Вид() = "МаршрутнаяКарта" Тогда
								СписокПодчиненных.Добавить(ПодчДок.НомерДок,ПолучитьНомерМТК(ТЧ.Ссылка));
								Проведен = ПодчДок.Проведен();
								ПодчДок.ДокументОснование = "";
								ПодчДок.Комментарий = ПолучитьНомерМТК(ТЧ.Ссылка);
								ПодчДок.Записать();
									Если Проведен Тогда
									ПодчДок.Провести();								
									КонецЕсли;
								ИначеЕсли ПодчДок.Вид() = "ТехОперации" Тогда
								ПодчДок.Удалить(0);
								КонецЕсли;
						КонецЦикла;					
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
СформироватьОтчет(СписокПодчиненных); 
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для каждого ТЧ Из ТаблицаМТК Цикл	
	ТЧ.Пометка = Истина;
	КонецЦикла; 	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Для каждого ТЧ Из ТаблицаМТК Цикл	
	ТЧ.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры
